<template>
    <div class="agreement">
        <Headers @goBack="goBack"></Headers>
        <div class="section">
            <p>
                本协议由您与上海尚标互联网科技有限公司共同缔结，
                本协议具有合同效力。本协议中协议“一方”或“双方”
                合称协议方，上海尚标互联网科技有限公司在本协议中
                亦称为“尚标”。
            </p>
            <p>
               第一章 综述总则<br/> 
               第一条 本协议内容包括协议正文及所有尚标
               已经发布或将来可能发布的与《尚标诚信保证金使用协议》
               相关的规则。前述规则为本协议不可分割的组成部分，
               与协议正文具有同等法律效力。
            </p>
            <p>
                第二条 您应当认真阅读全部协议内容，
                对于协议中以粗体下划线标注的内容，
                您应重点阅读。如您对本协议有任何疑问，
                应向尚标咨询。
                但无论您事实上是否认真阅读了本协议内容，
                只要您在线点击签署了本协议或者在尚标进行交易，
                则本协议即对您产生约束，
                届时您不应以未阅读本协议的内容或者未获得尚标对您问询的解答等理由
                ，主张本协议无效，或要求撤销本协议。
            </p>
            <P>
                第三条 您承诺接受并遵守本协议的约定。
                如果您不同意本协议的约定，
                您应立即结束您在尚标的一切行为。
                您在线点击“同意”本协议或者在尚标从事交易的，
                视为认同本协议效力。
            </P>
            <P>          
                第四条 尚标有权根据需要不时地修订本协议，
                并以网站公示的方式进行公告，不再单独通知您。
                变更后的协议和规则一经在尚标站公布后，
                立即自动生效。如您不同意相关变更，
                应当立即停止使用尚标。您继续在尚标进行交易的，
                包括但不限于维持所发布的商标／店铺信息，
                或继续发布商标／店铺信息，
                使用保证金标识，即表示您接受经修订后的协议。
            </P>
            <P>
                第二章 保证金<br/>
                商标权利人需根据本协议条款之约定缴存，
                并不可撤销地授权尚标及其关联公司有权根据本协议条款
                及尚标其他公示规则的规定锁定、使用、处置保证金。
            </P>
            <P>
                第一节 保证金的缴存<br/>
                第一条 除特殊规定外，委托尚标出售商标均需缴纳保证金。
                商标权利人事实上缴纳了保证金且保证金余额大于等于人民币30000元，
                则其名下商标可被打上【诚信】标签，并且享有网站优先推广权。
                商标权利人在与尚标合作过程中须遵守诚实信用原则，
                如商标权利人违反诚实信用原则（包括对正式合约及各类非正式约定的违约行为），
                尚标有权使用诚信保证金向权益受损人进行先行赔付。
            </P>
            <P>
                第二条 为保障商标权利人权益，保证金标准由尚标根据实际情况制定，并以尚标公布的最新内容为准。
            </P>
            <P>
                第三条 在上述约定的基础上，尚标有权根据商标权利人业务变化及实际违约赔付情况以书面方式通知商标权利人调整保证金金额。
            </P>
            <P>
                第四条 若尚标使用自有资金替商标权利人向客户垫付了赔偿金，尚标有权向商标权利人进行追偿，并要求商标权利人按照尚标公布的“诚信保证金标准”补足保证金金额。
            </P>
            <P>
                第二节 保证金的止付锁定
            </P>
            <P>
                第五条 商标权利人不可撤销地授权尚标有权将其缴存的保证金止付锁定于其在尚标开设的账户中。
            </P>
            <P>
                第三节 保证金的管理与使用
            </P>
            <P>
                第六条 尚标有权在包括但不限于以下情况发生时，处置商标权利人的保证金：<br/>
                1、如商标权利人通过尚标发布商标并成交，在履行交易相关义务过程中，违反国家法律、法规、政策、尚标任何规则，或违反商标权利人对客户的承诺，或被客户申请维权、索赔时，尚标有权根据其独立的判断，无须承担责任地，直接使用商标权利人的保证金对客户和尚标进行违约赔付。<br/>
                2、如商标权利人违反本协议和/或尚标任何规则和／或商标权利人与尚标签署的其他协议，给尚标或其关联公司造成任何损失（包括但不限于诉讼赔偿、诉讼费用、律师费用等）的，尚标有权根据其独立的判断，无须承担责任地，直接从商标权利人所缴纳的保证金中扣除相当于尚标或其关联公司损失的金额，以补偿尚标或其关联公司所遭受的损失。
            </P>
            <P>
                第七条 尚标如使用保证金进行违约赔付时，将以书面方式（包括但不限于站内消息，短信，电子邮件、传真等）通知商标权利人。在向商标权利人出具的书面通知中，将说明扣除原因及扣除金额。通知发出时将立即予以执行。
            </P>
            <P>
                第八条 如商标权利人的保证金不足以赔付客户损失时，商标权利人应自行支付额外的赔付金额。交易双方均认可，在商标权利人保证金或其尚标账户余额不足时，尚标没有使用自有资金向客户或者任何第三方支付赔偿金、补偿金或其它任何款项的义务，商标权利人仍应对客户或者其他权利人承担赔付、补偿义务。但商标权利人明确同意，如商标权利人的保证金或其尚标账户余额不足以赔付，且其未自行向客户支付额外的赔付金额时，尚标有权但无义务使用自有资金代替商标权利人向客户进行赔付（该代为赔付行为非尚标义务，该赔偿金额仅以涉及纠纷下的单次交易中客户通过尚标系统实际向商标权利人支付的金额减去商标权利人账户可支配保证金的金额为限）；此等情形下，尚标有权向商标权利人追偿，包括但不限于采用以下两种方式：<br/>
                1、要求商标权利人在尚标赔付后7日内向尚标偿还与赔付金数额相同的资金；<br/>
                2、将商标权利人尚标账户下（包含关联账户）的款项直接扣转给尚标，以补偿尚标所遭受的损失。<br/>
                如尚标通过上述二种方式无法追偿时，则尚标有权单方面终止向商标权利人提供服务，而且有权通过其他方式向商标权利人追偿。
            </P>
            <p>
                第九条 商标权利人对客户、任何第三方以及尚标的赔付责任不以商标权利人已缴纳的保证金数额为限。
            </p>
            <p>
                第三章 有限责任
            </p>
            <p>
                第十条 协议方了解并同意，尚标及其关联公司并非司法机构，仅能以普通或非专业人员的知识水平标准对协议方提交的证据材料进行鉴别，尚标及其关联公司对交易纠纷的调处完全是基于协议方的委托，尚标及其关联公司无法保证交易纠纷处理结果符合交易双方的期望，也不对交易纠纷调处结果及保证金的赔付决定承担任何责任。协议方应保证其提交的证据材料的真实性、合法性，并承担其提供的信息、数据不实的风险和责任。如协议方因此遭受损失，协议方均同意自行向受益人索赔，尚标应予以免责。
            </p>
            <p>
                第四章 委托支付
            </p>
            <p>
                第十一条 本协议一旦生效，即表示商标权利人已充分理解并同意向尚标作出授权，商标权利人授权尚标对其尚标账户中的保证金、余额进行相应操作，此授权为不可撤销授权。
            </p>
            <p>
                
                第十二条 根据本协议的约定，尚标有权对尚标账户进行如下类型的操作：<br/>
                1、保证金的止付锁定、解除止付锁定；<br/>
                2、划扣保证金用于执行违约赔付或划扣保证金用于赔偿尚标及其关联公司的损失；<br/>
                3、在保证金不足时，划扣尚标账户中的余额补充保证金；<br/>
                4、如尚标根据商标权利人的委托代商标权利人向雇主进行了赔付，或者因商标权利人的原因导致尚标及其关联公司发生损失的，或发生风险事件尚标必须采取紧急措施避免损失扩大的，尚标有权从商标权利人的尚标账户中划扣／止付锁定同等金额的款项和／或关闭尚标账户的全部或部分功能。
            </p>
            <p>
                第五章 协议终止
            </p>
            <p>
                第十三条 商标权利人退出尚标时方可申请退还诚信保证金现金余额。商标权利人退出诚信保证金需满足以下条件：<br/>
                1、无未处理完成的举报维权<br/>
                2、无未偿还的平台垫付款项<br/>
                3、无未结束的交易<br/>
                4、最后一笔已完结的交易的完结时间已经超过360天。<br/>
                商标权利人退出诚信保证金即本协议终止。
            </p>
            <p>
                第十四条 出现以下情况时，本协议终止。本协议终止后，商标权利人将退出尚标经营活动，不能再使用相关标识：<br/>
                1、自然终止：如商标权利人在线签署的《尚标服务协议》因任何原因终止，则本协议将同时终止。<br/>
                2、通知解除：尚标有权提前7天以书面通知的方式终止本协议。<br/>
                3、尚标单方解除权：尚标按照尚标相关规定行使单方解除权，本协议随同解除。<br/>
                4、本协议（含规则）变更时，商标权利人明示并通知尚标不愿接受新的服务协议，则本协议自尚标收到商标权利人通知之日起自动终止。<br/>
                5、本协议规定的其他协议终止条件发生或实现，导致本协议终止。
            </p>
            <p>
                第十五条 无论本协议因何原因终止，在协议终止前的行为所导致的任何赔偿和责任，商标权利人必须完全且独立地承担责任。即使本协议终止，尚标及其关联公司仍有权根据本协议的规定处理，包括但不限于使用商标权利人尚标账户中的保证金、余额来处理因本协议有效期内发生的交易所导致的客户索赔。
            </p>
            <p>
                第十六条 本协议第三章的效力不因本协议的终止而终止。
            </p>
            <p>
                第六章 争议解决
            </p>
            <p>
                第十七条 本协议之解释与适用，以及与本协议有关的争议，均应依照中华人民共和国大陆地区法律予以处理，并以上海市仲裁委员会为仲裁机构。
            </p>
            <p>
                第七章 其他
            </p>
            <p>
                第十八条 如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部份则仍具有法律效力。
            </p>
            <p>
                第十九条 尚标未行使本协议约定之权利的，不视为尚标的弃权行为。
            </p>
            <p>
                第二十条 尚标基于本协议享有的权利以及获得的授权，均可以全部或部分转移、转让、许可、分授权、转授权给任何第三方行使。未经尚标事先书面同意，商标权利人不得将本协议项下的权利义务转让给任何第三方。
            </p>
            <p>
                第二十一条 本协议最终解释权归尚标。
            </p>
        </div>
        <div class="bottom" v-show="!showSubBottom">
            <div class="left">
                <span>
                    <input type="checkbox" v-model="selected"   id="all" >
                    <label for="all"></label>
                </span>
                <span>勾选即表示接受协议所示内容</span>
            </div>
            <span  class="right" @click="applyJoin">申请加入</span>
        </div>
        <div class="subBottom" v-show="showSubBottom">
            工作人员将在1-2个工作日内与您联系
        </div>
    </div>
</template>
<script>
import Headers from '@/components/Header'
import {agreement,faith,bondsAdd} from '@/api/faith'
import '@/style/faithDeposit/agreement.scss'
import { setTimeout } from 'timers';
export default {
    components:{
        Headers,
    },
    data(){
        return{
            selected:false,
            tipMsg:"提交成功",
            showSubBottom:false,
        }
    },
    created(){
    },
    methods:{
        // getAgreement(){
        //     agreement().then((res)=>{
        //         console.log(res,"res")
        //     })
        // },
        applyJoin(){
            if(!this.selected){
                this.$toast.text("请勾选协议")
            }else{
                bondsAdd().then((res)=>{
                     this.$toast.text("提交成功")
                    this.showSubBottom = true
                })
            }

        }
    }
}
</script>

